In [1]:
import pandas as pd

In [2]:
## üìç 2. Pandas ma‚Äôlumot tuzilmalari: Series va DataFrame
# Pandas ikkita asosiy obyektga ega:

# Series ‚Äì bitta o‚Äòlchamli ma‚Äôlumotlar to‚Äòplami (1D).
# DataFrame ‚Äì ikki o‚Äòlchamli jadval ko‚Äòrinishidagi ma‚Äôlumotlar to‚Äòplami (2D).

In [5]:
#  1D ‚Äì Series yaratish

data = [10, 20, 30, 40]
s = pd.Series(data)
s

0    10
1    20
2    30
3    40
dtype: int64

In [ ]:
# Series indekslanadi
s[1]

np.int64(20)

In [8]:
# 2D ‚Äì DataFrame yaratish
data = {
    "Ism": ["Ali", "Vali", "Hasan"],
    "Yosh": [25, 30, 22],
    "Shahar": ["Toshkent", "Samarqand", "Buxoro"]
}

df = pd.DataFrame(data)
df

     Ism  Yosh     Shahar
0    Ali    25   Toshkent
1   Vali    30  Samarqand
2  Hasan    22     Buxoro

In [10]:
df = pd.read_csv("data.csv")  # "data.csv" o'rniga fayl nomini yozing
df.head() # Birinchi 5 qatorni ko‚Äòrish

   ID     Ism  Yosh     Shahar                     Kasb  Maosh
0   1     Ali    25   Toshkent                Dasturchi  12000
1   2    Vali    30  Samarqand                 Muhandis  11000
2   3   Hasan    22     Buxoro               O'qituvchi   8000
3   4  Kamola    27   Namangan                 Shifokor  15000
4   5    Ozod    35   Farg'ona  Hayot sug'urtasi agenti   9000

In [11]:
df.to_csv("output.csv", index=False)  # index=False indeksni saqlamaslik uchun

In [14]:
df = pd.read_excel("data.xlsx")
df.to_excel("output.xlsx", index=False)

In [15]:
df.head() # Birinchi 5 qator

   ID     Ism  Yosh     Shahar                     Kasb  Maosh
0   1     Ali    25   Toshkent                Dasturchi  12000
1   2    Vali    30  Samarqand                 Muhandis  11000
2   3   Hasan    22     Buxoro               O'qituvchi   8000
3   4  Kamola    27   Namangan                 Shifokor  15000
4   5    Ozod    35   Farg'ona  Hayot sug'urtasi agenti   9000

In [16]:
df.tail(3) # Oxirgi 3 qator

   ID      Ism  Yosh  Shahar                   Kasb  Maosh
7   8  Nilufar    24  Qarshi  Marketing mutaxassisi   9800
8   9    Bobur    31  Navoiy               Labarant   8700
9  10   Madina    29    Xiva         IT mutaxassisi  13000

In [17]:
df.shape # O‚Äòlcham (qator, ustun)

(10, 6)

In [18]:
df.info()  # Ma‚Äôlumot turi va null qiymatlar

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      10 non-null     int64
 1   Ism     10 non-null     object
 2   Yosh    10 non-null     int64
 3   Shahar  10 non-null     object
 4   Kasb    10 non-null     object
 5   Maosh   10 non-null     int64
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [19]:
df.describe()  # Statistika (sonli ustunlar uchun)

             ID       Yosh         Maosh
count  10.00000  10.000000     10.000000
mean    5.50000  27.700000  10650.000000
std     3.02765   3.772709   2160.375482
min     1.00000  22.000000   8000.000000
25%     3.25000  25.250000   9125.000000
50%     5.50000  27.500000  10150.000000
75%     7.75000  29.750000  11750.000000
max    10.00000  35.000000  15000.000000

In [20]:
df["Ism"] # Bitta ustun

0        Ali
1       Vali
2      Hasan
3     Kamola
4       Ozod
5     Shahlo
6    Jamshid
7    Nilufar
8      Bobur
9     Madina
Name: Ism, dtype: object

In [21]:
df[["Ism", "Yosh"]]  # Bir necha ustun

       Ism  Yosh
0      Ali    25
1     Vali    30
2    Hasan    22
3   Kamola    27
4     Ozod    35
5   Shahlo    28
6  Jamshid    26
7  Nilufar    24
8    Bobur    31
9   Madina    29

In [22]:
df.iloc[2] # 2-qatordagi ma‚Äôlumotlar

ID                 3
Ism            Hasan
Yosh              22
Shahar        Buxoro
Kasb      O'qituvchi
Maosh           8000
Name: 2, dtype: object

In [23]:
df.loc[0] # 0-indeksdagi qator

ID                1
Ism             Ali
Yosh             25
Shahar     Toshkent
Kasb      Dasturchi
Maosh         12000
Name: 0, dtype: object

In [24]:
# 25 yoshdan katta odamlarni olish
df[df["Yosh"] > 25]

   ID      Ism  Yosh     Shahar                     Kasb  Maosh
1   2     Vali    30  Samarqand                 Muhandis  11000
3   4   Kamola    27   Namangan                 Shifokor  15000
4   5     Ozod    35   Farg'ona  Hayot sug'urtasi agenti   9000
5   6   Shahlo    28    Andijon                 Hisobchi   9500
6   7  Jamshid    26     Termiz                 Dizayner  10500
8   9    Bobur    31     Navoiy                 Labarant   8700
9  10   Madina    29       Xiva           IT mutaxassisi  13000

In [ ]:
# Toshkent shahridagi odamlar

df[df["Shahar"] == "Toshkent"]

   ID  Ism  Yosh    Shahar       Kasb  Maosh
0   1  Ali    25  Toshkent  Dasturchi  12000

In [26]:
df.isnull().sum() # Har bir ustunda nechta NaN borligini ko‚Äòrish

ID        0
Ism       0
Yosh      0
Shahar    0
Kasb      0
Maosh     0
dtype: int64

In [27]:
df.fillna("Noma‚Äôlum", inplace=True) # NaN qiymatlarni to‚Äòldirish

In [28]:
df.dropna(inplace=True) # NaN qiymatlarni o‚Äòchirish

In [33]:
df["Yangi_Maosh"] = [5000, 6000, 5500, 7000, 8000, 6500, 7200, 7800, 8100, 9000]
df

   ID      Ism  Yosh     Shahar                     Kasb  Maosh  Yangi_Maosh
0   1      Ali    25   Toshkent                Dasturchi  12000         5000
1   2     Vali    30  Samarqand                 Muhandis  11000         6000
2   3    Hasan    22     Buxoro               O'qituvchi   8000         5500
3   4   Kamola    27   Namangan                 Shifokor  15000         7000
4   5     Ozod    35   Farg'ona  Hayot sug'urtasi agenti   9000         8000
5   6   Shahlo    28    Andijon                 Hisobchi   9500         6500
6   7  Jamshid    26     Termiz                 Dizayner  10500         7200
7   8  Nilufar    24     Qarshi    Marketing mutaxassisi   9800         7800
8   9    Bobur    31     Navoiy                 Labarant   8700         8100
9  10   Madina    29       Xiva           IT mutaxassisi  13000         9000

In [38]:


new_row = {"Ism": "Olim", "Yosh": 28, "Shahar": "Namangan", "Maosh": 6200, "Yangi_Maosh": 4000}

# new_row ni DataFrame ga aylantiramiz va concat() orqali qo‚Äòshamiz
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
df.tail()

      ID      Ism  Yosh    Shahar                   Kasb  Maosh  Yangi_Maosh
7    8.0  Nilufar    24    Qarshi  Marketing mutaxassisi   9800         7800
8    9.0    Bobur    31    Navoiy               Labarant   8700         8100
9   10.0   Madina    29      Xiva         IT mutaxassisi  13000         9000
10   NaN     Olim    28  Namangan                    NaN   6200         4000
11   NaN     Olim    28  Namangan                    NaN   6200         4000

In [42]:
df.drop(columns=["Yangi_Maosh"], inplace=True)
df

      ID      Ism  Yosh     Shahar                     Kasb
0    1.0      Ali    25   Toshkent                Dasturchi
1    2.0     Vali    30  Samarqand                 Muhandis
2    3.0    Hasan    22     Buxoro               O'qituvchi
3    4.0   Kamola    27   Namangan                 Shifokor
4    5.0     Ozod    35   Farg'ona  Hayot sug'urtasi agenti
5    6.0   Shahlo    28    Andijon                 Hisobchi
6    7.0  Jamshid    26     Termiz                 Dizayner
7    8.0  Nilufar    24     Qarshi    Marketing mutaxassisi
8    9.0    Bobur    31     Navoiy                 Labarant
9   10.0   Madina    29       Xiva           IT mutaxassisi
10   NaN     Olim    28   Namangan                      NaN
11   NaN     Olim    28   Namangan                      NaN

In [43]:
df.drop(index=2, inplace=True)  # 2-indexdagi qatorni o‚Äòchirish
df

      ID      Ism  Yosh     Shahar                     Kasb
0    1.0      Ali    25   Toshkent                Dasturchi
1    2.0     Vali    30  Samarqand                 Muhandis
3    4.0   Kamola    27   Namangan                 Shifokor
4    5.0     Ozod    35   Farg'ona  Hayot sug'urtasi agenti
5    6.0   Shahlo    28    Andijon                 Hisobchi
6    7.0  Jamshid    26     Termiz                 Dizayner
7    8.0  Nilufar    24     Qarshi    Marketing mutaxassisi
8    9.0    Bobur    31     Navoiy                 Labarant
9   10.0   Madina    29       Xiva           IT mutaxassisi
10   NaN     Olim    28   Namangan                      NaN
11   NaN     Olim    28   Namangan                      NaN

In [44]:
df.groupby("Shahar")["Yosh"].mean() # Shahar bo‚Äòyicha yoshlarning o‚Äòrtacha qiymati

Shahar
Andijon      28.000000
Farg'ona     35.000000
Namangan     27.666667
Navoiy       31.000000
Qarshi       24.000000
Samarqand    30.000000
Termiz       26.000000
Toshkent     25.000000
Xiva         29.000000
Name: Yosh, dtype: float64

In [45]:
df.groupby("Shahar")["Yosh"].sum() # Har bir shahardagi yigitlarning yoshi yig‚Äòindisi

Shahar
Andijon      28
Farg'ona     35
Namangan     83
Navoiy       31
Qarshi       24
Samarqand    30
Termiz       26
Toshkent     25
Xiva         29
Name: Yosh, dtype: int64

In [46]:
df.sort_values(by="Yosh")  # Yosh bo‚Äòyicha saralash

      ID      Ism  Yosh     Shahar                     Kasb
7    8.0  Nilufar    24     Qarshi    Marketing mutaxassisi
0    1.0      Ali    25   Toshkent                Dasturchi
6    7.0  Jamshid    26     Termiz                 Dizayner
3    4.0   Kamola    27   Namangan                 Shifokor
5    6.0   Shahlo    28    Andijon                 Hisobchi
10   NaN     Olim    28   Namangan                      NaN
11   NaN     Olim    28   Namangan                      NaN
9   10.0   Madina    29       Xiva           IT mutaxassisi
1    2.0     Vali    30  Samarqand                 Muhandis
8    9.0    Bobur    31     Navoiy                 Labarant
4    5.0     Ozod    35   Farg'ona  Hayot sug'urtasi agenti

In [47]:
df.sort_values(by="Yosh", ascending=False)  # Kamayish tartibida saralash

      ID      Ism  Yosh     Shahar                     Kasb
4    5.0     Ozod    35   Farg'ona  Hayot sug'urtasi agenti
8    9.0    Bobur    31     Navoiy                 Labarant
1    2.0     Vali    30  Samarqand                 Muhandis
9   10.0   Madina    29       Xiva           IT mutaxassisi
11   NaN     Olim    28   Namangan                      NaN
10   NaN     Olim    28   Namangan                      NaN
5    6.0   Shahlo    28    Andijon                 Hisobchi
3    4.0   Kamola    27   Namangan                 Shifokor
6    7.0  Jamshid    26     Termiz                 Dizayner
0    1.0      Ali    25   Toshkent                Dasturchi
7    8.0  Nilufar    24     Qarshi    Marketing mutaxassisi

ModuleNotFoundError: No module named 'matplotlib'